backend/app/controllers/blog_entries_controller.rb

  def index
    @blog_entries = BlogEntry.all
---
SELECT "blog_entries".* FROM "blog_entries"

  def show
    @blog_entry = BlogEntry.find_by(id: params[:id])
---
SELECT  "blog_entries".* FROM "blog_entries"  WHERE "blog_entries"."id" = -1 LIMIT 1

  def destroy
    @blog_entry = BlogEntry.find_by_id params[:id]
---
SELECT  "blog_entries".* FROM "blog_entries"  WHERE "blog_entries"."id" = 1 LIMIT 1