app/controllers/comments_controller.rb

  def create
  	@comment = Comment.new(comment_params)
  	@comment.assign_attributes(blog_entry_id: params[:id])

  	status = 200
  	if @comment.save
---
INSERT INTO "comments" ("blog_entry_id", "created_at", "post", "title", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["blog_entry_id", 1], ["created_at", Mon, 18 Aug 2014 16:40:08 UTC +00:00], ["post", "masmolas"], ["title", "comentario 1"], ["updated_at", Mon, 18 Aug 2014 16:40:08 UTC +00:00]]

  def index
  	@comments = BlogEntry.find(params[:id]).comments.order(id: :desc)
---
SELECT "blog_entries".* FROM "blog_entries" WHERE "blog_entries"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "comments".* FROM "comments" WHERE "comments"."blog_entry_id" = $1 ORDER BY "comments"."id" DESC  [["blog_entry_id", 1]]

  def show
  	@comment = Comment.find_by_id params[:id]
---
SELECT  "comments".* FROM "comments"  WHERE "comments"."id" = -1 LIMIT 1

  def destroy
  	@comment = Comment.find_by_id params[:id]

  	unless @comment.nil?
  		if @comment.destroy
---
SELECT  "comments".* FROM "comments"  WHERE "comments"."id" = 13 LIMIT 1
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 13]]